[
  {
    "paragraph": "1 The Constitution Act, 1982 set out in Schedule B to this Act is hereby enacted for and shall have the force of law in Canada and shall come into force as provided in that Act. "
  },
  {
    "paragraph": "2 No Act of the Parliament of the United Kingdom passed after the Constitution Act, 1982 comes into force shall extend to Canada as part of its law. "
  },
  {
    "paragraph": "3 So far as it is not contained in Schedule B, the French version of this Act is set out in Schedule A to this Act and has the same authority in Canada as the English version thereof. "
  },
  {
    "paragraph": "4 This Act may be cited as the Canada Act 1982. "
  },
  {
    "paragraph": "1 The Canadian Charter of Rights and Freedoms guarantees the rights and freedoms set out in it subject only to such reasonable limits prescribed by law as can be demonstrably justified in a free and democratic society. "
  },
  {
    "paragraph": "2 Everyone has the following fundamental freedoms: "
  },
  {
    "paragraph": "3 Every citizen of Canada has the right to vote in an election of members of the House of Commons or of a legislative assembly and to be qualified for membership therein. "
  },
  {
    "paragraph": "4 (1) No House of Commons and no legislative assembly shall continue for longer than five years from the date fixed for the return of the writs of a general election of its members.(82) "
  },
  {
    "paragraph": "5 There shall be a sitting of Parliament and of each legislature at least once every twelve months.(84) "
  },
  {
    "paragraph": "6 (1) Every citizen of Canada has the right to enter, remain in and leave Canada. "
  },
  {
    "paragraph": "7 Everyone has the right to life, liberty and security of the person and the right not to be deprived thereof except in accordance with the principles of fundamental justice. "
  },
  {
    "paragraph": "8 Everyone has the right to be secure against unreasonable search or seizure. "
  },
  {
    "paragraph": "9 Everyone has the right not to be arbitrarily detained or imprisoned. "
  },
  {
    "paragraph": "10 Everyone has the right on arrest or detention "
  },
  {
    "paragraph": "11 Any person charged with an offence has the right "
  },
  {
    "paragraph": "12 Everyone has the right not to be subjected to any cruel and unusual treatment or punishment. "
  },
  {
    "paragraph": "13 A witness who testifies in any proceedings has the right not to have any incriminating evidence so given used to incriminate that witness in any other proceedings, except in a prosecution for perjury or for the giving of contradictory evidence. "
  },
  {
    "paragraph": "14 A party or witness in any proceedings who does not understand or speak the language in which the proceedings are conducted or who is deaf has the right to the assistance of an interpreter. "
  },
  {
    "paragraph": "15 (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. "
  },
  {
    "paragraph": "16 (1) English and French are the official languages of Canada and have equality of status and equal rights and privileges as to their use in all institutions of the Parliament and government of Canada. "
  },
  {
    "paragraph": "16.1 (1) The English linguistic community and the French linguistic community in New Brunswick have equality of status and equal rights and privileges, including the right to distinct educational institutions and such distinct cultural institutions as are necessary for the preservation and promotion of those communities. "
  },
  {
    "paragraph": "17 (1) Everyone has the right to use English or French in any debates and other proceedings of Parliament.(87) "
  },
  {
    "paragraph": "18 (1) The statutes, records and journals of Parliament shall be printed and published in English and French and both language versions are equally authoritative.(89) "
  },
  {
    "paragraph": "19 (1) Either English or French may be used by any person in, or in any pleading in or process issuing from, any court established by Parliament.(91) "
  },
  {
    "paragraph": "20 (1) Any member of the public in Canada has the right to communicate with, and to receive available services from, any head or central office of an institution of the Parliament or government of Canada in English or French, and has the same right with respect to any other office of any such institution where "
  },
  {
    "paragraph": "21 Nothing in sections 16 to 20 abrogates or derogates from any right, privilege or obligation with respect to the English and French languages, or either of them, that exists or is continued by virtue of any other provision of the Constitution of Canada.(93) "
  },
  {
    "paragraph": "22 Nothing in sections 16 to 20 abrogates or derogates from any legal or customary right or privilege acquired or enjoyed either before or after the coming into force of this Charter with respect to any language that is not English or French. "
  },
  {
    "paragraph": "23 (1) Citizens of Canada "
  },
  {
    "paragraph": "24 (1) Anyone whose rights or freedoms, as guaranteed by this Charter, have been infringed or denied may apply to a court of competent jurisdiction to obtain such remedy as the court considers appropriate and just in the circumstances. "
  },
  {
    "paragraph": "25 The guarantee in this Charter of certain rights and freedoms shall not be construed so as to abrogate or derogate from any aboriginal, treaty or other rights or freedoms that pertain to the aboriginal peoples of Canada including "
  },
  {
    "paragraph": "26 The guarantee in this Charter of certain rights and freedoms shall not be construed as denying the existence of any other rights or freedoms that exist in Canada. "
  },
  {
    "paragraph": "27 This Charter shall be interpreted in a manner consistent with the preservation and enhancement of the multicultural heritage of Canadians. "
  },
  {
    "paragraph": "28 Notwithstanding anything in this Charter, the rights and freedoms referred to in it are guaranteed equally to male and female persons. "
  },
  {
    "paragraph": "29 Nothing in this Charter abrogates or derogates from any rights or privileges guaranteed by or under the Constitution of Canada in respect of denominational, separate or dissentient schools.(96) "
  },
  {
    "paragraph": "30 A reference in this Charter to a province or to the legislative assembly or legislature of a province shall be deemed to include a reference to the Yukon Territory and the Northwest Territories, or to the appropriate legislative authority thereof, as the case may be. "
  },
  {
    "paragraph": "31 Nothing in this Charter extends the legislative powers of any body or authority. "
  },
  {
    "paragraph": "32 (1) This Charter applies "
  },
  {
    "paragraph": "33 (1) Parliament or the legislature of a province may expressly declare in an Act of Parliament or of the legislature, as the case may be, that the Act or a provision thereof shall operate notwithstanding a provision included in section 2 or sections 7 to 15 of this Charter. "
  },
  {
    "paragraph": "34 This Part may be cited as the Canadian Charter of Rights and Freedoms. "
  },
  {
    "paragraph": "35 (1) The existing aboriginal and treaty rights of the aboriginal peoples of Canada are hereby recognized and affirmed. "
  },
  {
    "paragraph": "35.1 The government of Canada and the provincial governments are committed to the principle that, before any amendment is made to Class 24 of section 91 of the Constitution Act, 1867, to section 25 of this Act or to this Part, "
  },
  {
    "paragraph": "36 (1) Without altering the legislative authority of Parliament or of the provincial legislatures, or the rights of any of them with respect to the exercise of their legislative authority, Parliament and the legislatures, together with the government of Canada and the provincial governments, are committed to "
  },
  {
    "paragraph": "37 Repealed.(100) "
  },
  {
    "paragraph": "37.1 Repealed.(101) "
  },
  {
    "paragraph": "38 (1) An amendment to the Constitution of Canada may be made by proclamation issued by the Governor General under the Great Seal of Canada where so authorized by "
  },
  {
    "paragraph": "39 (1) A proclamation shall not be issued under subsection 38(1) before the expiration of one year from the adoption of the resolution initiating the amendment procedure thereunder, unless the legislative assembly of each province has previously adopted a resolution of assent or dissent. "
  },
  {
    "paragraph": "40 Where an amendment is made under subsection 38(1) that transfers provincial legislative powers relating to education or other cultural matters from provincial legislatures to Parliament, Canada shall provide reasonable compensation to any province to which the amendment does not apply. "
  },
  {
    "paragraph": "41 An amendment to the Constitution of Canada in relation to the following matters may be made by proclamation issued by the Governor General under the Great Seal of Canada only where authorized by resolutions of the Senate and House of Commons and of the legislative assembly of each province: "
  },
  {
    "paragraph": "42 (1) An amendment to the Constitution of Canada in relation to the following matters may be made only in accordance with subsection 38(1): "
  },
  {
    "paragraph": "43 An amendment to the Constitution of Canada in relation to any provision that applies to one or more, but not all, provinces, including "
  },
  {
    "paragraph": "44 Subject to sections 41 and 42, Parliament may exclusively make laws amending the Constitution of Canada in relation to the executive government of Canada or the Senate and House of Commons. "
  },
  {
    "paragraph": "45 Subject to section 41, the legislature of each province may exclusively make laws amending the constitution of the province. "
  },
  {
    "paragraph": "46 (1) The procedures for amendment under sections 38, 41, 42 and 43 may be initiated either by the Senate or the House of Commons or by the legislative assembly of a province. "
  },
  {
    "paragraph": "47 (1) An amendment to the Constitution of Canada made by proclamation under section 38, 41, 42 or 43 may be made without a resolution of the Senate authorizing the issue of the proclamation if, within one hundred and eighty days after the adoption by the House of Commons of a resolution authorizing its issue, the Senate has not adopted such a resolution and if, at any time after the expiration of that period, the House of Commons again adopts the resolution. "
  },
  {
    "paragraph": "48 The Queen’s Privy Council for Canada shall advise the Governor General to issue a proclamation under this Part forthwith on the adoption of the resolutions required for an amendment made by proclamation under this Part. "
  },
  {
    "paragraph": "49 A constitutional conference composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada within fifteen years after this Part comes into force to review the provisions of this Part.(103) "
  },
  {
    "paragraph": "50 (104) "
  },
  {
    "paragraph": "51 (105) "
  },
  {
    "paragraph": "52 (1) The Constitution of Canada is the supreme law of Canada, and any law that is inconsistent with the provisions of the Constitution is, to the extent of the inconsistency, of no force or effect. "
  },
  {
    "paragraph": "53 (1) The enactments referred to in Column I of the schedule are hereby repealed or amended to the extent indicated in Column II thereof and, unless repealed, shall continue as law in Canada under the names set out in Column III thereof. "
  },
  {
    "paragraph": "54 Part IV is repealed on the day that is one year after this Part comes into force and this section may be repealed and this Act renumbered, consequentially upon the repeal of Part IV and this section, by proclamation issued by the Governor General under the Great Seal of Canada.(106) "
  },
  {
    "paragraph": "54.1 Repealed.(107) "
  },
  {
    "paragraph": "55 A French version of the portions of the Constitution of Canada referred to in the schedule shall be prepared by the Minister of Justice of Canada as expeditiously as possible and, when any portion thereof sufficient to warrant action being taken has been so prepared, it shall be put forward for enactment by proclamation issued by the Governor General under the Great Seal of Canada pursuant to the procedure then applicable to an amendment of the same provisions of the Constitution of Canada.(108) "
  },
  {
    "paragraph": "56 Where any portion of the Constitution of Canada has been or is enacted in English and French or where a French version of any portion of the Constitution is enacted pursuant to section 55, the English and French versions of that portion of the Constitution are equally authoritative. "
  },
  {
    "paragraph": "57 The English and French versions of this Act are equally authoritative. "
  },
  {
    "paragraph": "58 Subject to section 59, this Act shall come into force on a day to be fixed by proclamation issued by the Queen or the Governor General under the Great Seal of Canada.(109) "
  },
  {
    "paragraph": "59 (1) Paragraph 23(1)(a) shall come into force in respect of Quebec on a day to be fixed by proclamation issued by the Queen or the Governor General under the Great Seal of Canada. "
  },
  {
    "paragraph": "60 This Act may be cited as the Constitution Act, 1982, and the Constitution Acts 1867 to 1975 (No. 2) and this Act may be cited together as the Constitution Acts, 1867 to 1982. "
  },
  {
    "paragraph": "61 A reference to the Constitution Acts, 1867 to 1982 shall be deemed to include a reference to the Constitution Amendment Proclamation, 1983.(111) "
  },
  {
    "paragraph": "1.\tBritish North America Act, 1867, 30-31 Vict., c. 3 (U.K.)\t "
  },
  {
    "paragraph": "2.\tAn Act to amend and continue the Act 32-33 Victoria chapter 3; and to establish and provide for the Government of the Province of Manitoba, 1870, 33 Vict., c. 3 (Can.)\t "
  },
  {
    "paragraph": "3.\tOrder of Her Majesty in Council admitting Rupert’s Land and the North-Western Territory into the Union, dated the 23rd day of June, 1870\t\tRupert’s Land and North-Western Territory Order "
  },
  {
    "paragraph": "4.\tOrder of Her Majesty in Council admitting British Columbia into the Union, dated the 16th day of May, 1871.\t\tBritish Columbia Terms of Union "
  },
  {
    "paragraph": "5.\tBritish North America Act, 1871, 34-35 Vict., c. 28 (U.K.)\t "
  },
  {
    "paragraph": "6.\tOrder of Her Majesty in Council admitting Prince Edward Island into the Union, dated the 26th day of June, 1873.\t\tPrince Edward Island Terms of Union "
  },
  {
    "paragraph": "7.\tParliament of Canada Act, 1875, 38-39 Vict., c. 38 (U.K.)\t\tParliament of Canada Act, 1875 "
  },
  {
    "paragraph": "8.\tOrder of Her Majesty in Council admitting all British possessions and Territories in North America and islands adjacent thereto into the Union, dated the 31st day of July, 1880.\t\tAdjacent Territories Order "
  },
  {
    "paragraph": "9.\tBritish North America Act, 1886, 49-50 Vict., c. 35 (U.K.)\t "
  },
  {
    "paragraph": "10.\tCanada (Ontario Boundary) Act, 1889, 52-53 Vict., c. 28 (U.K.)\t\tCanada (Ontario Boundary) Act, 1889 "
  },
  {
    "paragraph": "11.\tCanadian Speaker (Appointment of Deputy) Act, 1895, 2nd Sess., 59 Vict., c. 3 (U.K.)\t "
  },
  {
    "paragraph": "12.\tThe Alberta Act, 1905, 4-5 Edw. VII, c. 3 (Can.)\t\tAlberta Act "
  },
  {
    "paragraph": "13.\tThe Saskatchewan Act, 1905, 4-5 Edw. VII, c. 42 (Can.)\t\tSaskatchewan Act "
  },
  {
    "paragraph": "14.\tBritish North America Act, 1907, 7 Edw. VII, c. 11 (U.K.)\t "
  },
  {
    "paragraph": "15.\tBritish North America Act, 1915, 5-6 Geo. V, c. 45 (U.K.)\t "
  },
  {
    "paragraph": "16.\tBritish North America Act, 1930, 20-21, Geo. V, c. 26 (U.K.)\t "
  },
  {
    "paragraph": "17.\tStatute of Westminster, 1931, 22 Geo. V, c. 4 (U.K.)\t "
  },
  {
    "paragraph": "18.\tBritish North America Act, 1940, 3-4 Geo. VI, c. 36 (U.K.)\t "
  },
  {
    "paragraph": "19.\tBritish North America Act, 1943, 6-7 Geo. VI, c. 30 (U.K.)\t "
  },
  {
    "paragraph": "20.\tBritish North America Act, 1946, 9-10 Geo. VI, c. 63 (U.K.)\t "
  },
  {
    "paragraph": "21.\tBritish North America Act, 1949, 12-13 Geo. VI, c. 22 (U.K.)\t "
  },
  {
    "paragraph": "22.\tBritish North America (No. 2) Act, 1949, 13 Geo. VI, c. 81 (U.K.)\t "
  },
  {
    "paragraph": "23.\tBritish North America Act, 1951, 14-15 Geo. VI, c. 32 (U.K.)\t "
  },
  {
    "paragraph": "24.\tBritish North America Act, 1952, 1 Eliz. II, c. 15 (Can.)\t "
  },
  {
    "paragraph": "25.\tBritish North America Act, 1960, 9 Eliz. II, c. 2 (U.K.)\t "
  },
  {
    "paragraph": "26.\tBritish North America Act, 1964, 12-13 Eliz. II, c. 73 (U.K.)\t "
  },
  {
    "paragraph": "27.\tBritish North America Act, 1965, 14 Eliz. II, c. 4, Part I (Can.)\t "
  },
  {
    "paragraph": "28.\tBritish North America Act, 1974, 23 Eliz. II, c. 13, Part I (Can.)\t "
  },
  {
    "paragraph": "29.\tBritish North America Act, 1975, 23-24 Eliz. II, c. 28, Part I (Can.)\t "
  },
  {
    "paragraph": "30.\tBritish North America Act (No. 2), 1975, 23-24 Eliz. II, c. 53 (Can.)\t "
  },
  {
    "paragraph": "1 This Act may be cited as The British North America Act, 1867. "
  },
  {
    "paragraph": "2 The Provisions of this Act referring to Her Majesty the Queen extend also to the Heirs and Successors of Her Majesty, Kings and Queens of the United Kingdom of Great Britain and Ireland. "
  },
  {
    "paragraph": "4 The subsequent Provisions of this Act shall, unless it is otherwise expressed or implied, commence and have effect on and after the Union, that is to say, on and after the Day appointed for the Union taking effect in the Queen’s Proclamation; and in the same Provisions, unless it is otherwise expressed or implied, the Name Canada shall be taken to mean Canada as constituted under this Act. "
  },
  {
    "paragraph": "18 The Privileges, Immunities, and Powers to be held, enjoyed, and exercised by the Senate and by the House of Commons and by the Members thereof respectively shall be such as are from Time to Time defined by Act of the Parliament of Canada, but so that the same shall never exceed those at the passing of this Act held, enjoyed, and exercised by the Commons House of Parliament of the United Kingdom of Great Britain and Ireland and by the Members thereof. "
  },
  {
    "paragraph": "20 There shall be a Session of the Parliament of Canada once at least in every Year, so that Twelve Months shall not intervene between the last Sitting of the Parliament in one Session and its first sitting in the next Session. "
  },
  {
    "paragraph": "21 The Senate shall, subject to the Provisions of this Act, consist of Seventy-two Members, who shall be styled Senators. "
  },
  {
    "paragraph": "22 In relation to the Constitution of the Senate, Canada shall be deemed to consist of Three Divisions: "
  },
  {
    "paragraph": "1. Ontario; "
  },
  {
    "paragraph": "2. Quebec; "
  },
  {
    "paragraph": "3. The Maritime Provinces, Nova Scotia and New Brunswick; "
  },
  {
    "paragraph": "25 Such Persons shall be first summoned to the Senate as the Queen by Warrant under Her Majesty’s Royal Sign Manual thinks fit to approve, and their Names shall be inserted in the Queen’s Proclamation of Union. "
  },
  {
    "paragraph": "26 If at any Time on the Recommendation of the Governor General the Queen thinks fit to direct that Three or Six Members be added to the Senate, the Governor General may by Summons to Three or Six qualified Persons (as the Case may be), representing equally the Three Divisions of Canada, add to the Senate accordingly. "
  },
  {
    "paragraph": "27 In case of such Addition being at any Time made the Governor General shall not summon any Person to the Senate except on a further like Direction by the Queen on the like Recommendation, until each of the Three Divisions of Canada is represented by Twenty-four Senators and no more. "
  },
  {
    "paragraph": "28 The Number of Senators shall not at any Time exceed Seventy-eight. "
  },
  {
    "paragraph": "29 A Senator shall, subject to the Provisions of this Act, hold his Place in the Senate for Life. "
  },
  {
    "paragraph": "37 The House of Commons shall, subject to the Provisions of this Act, consist of one hundred and eighty-one members, of whom Eighty-two shall be elected for Ontario, Sixty-five for Quebec, Nineteen for Nova Scotia, and Fifteen for New Brunswick. "
  },
  {
    "paragraph": "42 For the First Election of Members to serve in the House of Commons the Governor General shall cause Writs to be issued by such Person, in such Form, and addressed to such Returning Officers as he thinks fit. "
  },
  {
    "paragraph": "43 In case a Vacancy in the Representation in the House of Commons of any Electoral District happens before the Meeting of the Parliament, or after the Meeting of the Parliament before Provision is made by the Parliament in this Behalf, the Provisions of the last foregoing Section of this Act shall extend and apply to the issuing and returning of a Writ in respect of such Vacant District. "
  },
  {
    "paragraph": "51 On the Completion of the Census in the Year One Thousand eight hundred and seventy-one, and of each subsequent decennial Census, the Representation of the Four Provinces shall be readjusted by such Authority, in such Manner, and from such Time, as the Parliament of Canada from Time to Time provides, subject and according to the following Rules: "
  },
  {
    "paragraph": "1. Quebec shall have the fixed Number of Sixty-five Members: "
  },
  {
    "paragraph": "2. There shall be assigned to each of the other Provinces such a Number of Members as will bear the same Proportion to the Number of its Population (ascertained at such Census) as the Number Sixty-five bears to the Number of the Population of Quebec (so ascertained): "
  },
  {
    "paragraph": "3. In the Computation of the Number of Members for a Province a fractional Part not exceeding One Half of the whole Number requisite for entitling the Province to a Member shall be disregarded; but a fractional Part exceeding One Half of that Number shall be equivalent to the whole Number: "
  },
  {
    "paragraph": "4. On any such Re-adjustment the Number of Members for a Province shall not be reduced unless the Proportion which the Number of the Population of the Province bore to the Number of the aggregate Population of Canada at the then last preceding Re-adjustment of the Number of Members for the Province is ascertained at the then latest Census to be diminished by One Twentieth Part or upwards: "
  },
  {
    "paragraph": "5. Such Re-adjustment shall not take effect until the Termination of the then existing Parliament. "
  },
  {
    "paragraph": "1. Subject as hereinafter provided, there shall be assigned to each of the provinces a number of members computed by dividing the total population of the provinces by two hundred and fifty-four and by dividing the population of each province by the quotient so obtained, disregarding, except as hereinafter in this section provided, the remainder, if any, after the said process of division. "
  },
  {
    "paragraph": "2. If the total number of members assigned to all the provinces pursuant to rule one is less than two hundred and fifty-four, additional members shall be assigned to the provinces (one to a province) having remainders in the computation under rule one commencing with the province having the largest remainder and continuing with the other provinces in the order of the magnitude of their respective remainders until the total number of members assigned is two hundred and fifty-four. "
  },
  {
    "paragraph": "3. Notwithstanding anything in this section, if upon completion of a computation under rules one and two, the number of members to be assigned to a province is less than the number of senators representing the said province, rules one and two shall cease to apply in respect of the said province, and there shall be assigned to the said province a number of members equal to the said number of senators. "
  },
  {
    "paragraph": "4. In the event that rules one and two cease to apply in respect of a province then, for the purpose of computing the number of members to be assigned to the provinces in respect of which rules one and two continue to apply, the total population of the provinces shall be reduced by the number of the population of the province in respect of which rules one and two have ceased to apply and the number two hundred and fifty-four shall be reduced by the number of members assigned to such province pursuant to rule three. "
  },
  {
    "paragraph": "5. Such readjustment shall not take effect until the termination of the then existing Parliament. "
  },
  {
    "paragraph": "1. There shall be assigned to each of the provinces a number of members computed by dividing the total population of the provinces by two hundred and sixty-one and by dividing the population of each province by the quotient so obtained, disregarding, except as hereinafter in this section provided, the remainder, if any, after the said process of division. "
  },
  {
    "paragraph": "2. If the total number of members assigned to all the provinces pursuant to rule one is less than two hundred and sixty-one, additional members shall be assigned to the provinces (one to a province) having remainders in the computation under rule one commencing with the province having the largest remainder and continuing with the other provinces in the order of the magnitude of their respective remainders until the total number of members assigned is two hundred and sixty-one. "
  },
  {
    "paragraph": "3. Notwithstanding anything in this section, if upon completion of a computation under rules one and two the number of members to be assigned to a province is less than the number of senators representing the said province, rules one and two shall cease to apply in respect of the said province, and there shall be assigned to the said province a number of members equal to the said number of senators. "
  },
  {
    "paragraph": "4. In the event that rules one and two cease to apply in respect of a province then, for the purposes of computing the number of members to be assigned to the provinces in respect of which rules one and two continue to apply, the total population of the provinces shall be reduced by the number of the population of the province in respect of which rules one and two have ceased to apply and the number two hundred and sixty-one shall be reduced by the number of members assigned to such province pursuant to rule three. "
  },
  {
    "paragraph": "5. On any such readjustment the number of members for any province shall not be reduced by more than fifteen per cent below the representation to which such province was entitled under rules one to four of this subsection at the last preceding readjustment of the representation of that province, and there shall be no reduction in the representation of any province as a result of which that province would have a smaller number of members than any other province that according to the results of the then last decennial census did not have a larger population; but for the purposes of any subsequent readjustment of representation under this section any increase in the number of members of the House of Commons resulting from the application of this rule shall not be included in the divisor mentioned in rules one to four of this subsection. "
  },
  {
    "paragraph": "6. Such readjustment shall not take effect until the termination of the then existing Parliament. "
  },
  {
    "paragraph": "1. There shall be assigned to Quebec seventy-five members in the readjustment following the completion of the decennial census taken in the year 1971, and thereafter four additional members in each subsequent readjustment. "
  },
  {
    "paragraph": "2. Subject to Rules 5(2) and (3), there shall be assigned to a large province a number of members equal to the number obtained by dividing the population of the large province by the electoral quotient of Quebec. "
  },
  {
    "paragraph": "3. Subject to Rules 5(2) and (3), there shall be assigned to a small province a number of members equal to the number obtained by dividing "
  },
  {
    "paragraph": "4. Subject to Rules 5(1)(a), (2) and (3), there shall be assigned to an intermediate province a number of members equal to the number obtained "
  },
  {
    "paragraph": "5.(1) On any readjustment, "
  },
  {
    "paragraph": "6. (1) In these Rules, "
  },
  {
    "paragraph": "1. There shall be assigned to each of the provinces a number of members equal to the number obtained by dividing the total population of the provinces by two hundred and seventy-nine and by dividing the population of each province by the quotient so obtained, counting any remainder in excess of 0.50 as one after the said process of division. "
  },
  {
    "paragraph": "2. If the total number of members that would be assigned to a province by the application of rule 1 is less than the total number assigned to that province on the date of coming into force of this subsection, there shall be added to the number of members so assigned such number of members as will result in the province having the same number of members as were assigned on that date. "
  },
  {
    "paragraph": "81 The Legislatures of Ontario and Quebec respectively shall be called together not later than Six Months after the Union. "
  },
  {
    "paragraph": "20 There shall be a Session of the Legislature once at least in every year, so that twelve months shall not intervene between the last sitting of the Legislature in one Session and its first sitting in the next Session. "
  },
  {
    "paragraph": "89 Each of the Lieutenant Governors of Ontario, Quebec and Nova Scotia shall cause Writs to be issued for the First Election of Members of the Legislative Assembly thereof in such Form and by such Person as he thinks fit, and at such Time and addressed to such Returning Officer as the Governor General directs, and so that the First Election of Member of Assembly for any Electoral District or any Subdivision thereof shall be held at the same Time and at the same Places as the Election for a Member to serve in the House of Commons of Canada for that Electoral District. "
  },
  {
    "paragraph": "1. The amendment from time to time of the Constitution of Canada, except as regards matters coming within the classes of subjects by this Act assigned exclusively to the Legislatures of the provinces, or as regards rights or privileges by this or any other Constitutional Act granted or secured to the Legislature or the Government of a province, or to any class of persons with respect to schools or as regards the use of the English or the French language or as regards the requirements that there shall be a session of the Parliament of Canada at least once each year, and that no House of Commons shall continue for more than five years from the day of the return of the Writs for choosing the House: provided, however, that a House of Commons may in time of real or apprehended war, invasion or insurrection be continued by the Parliament of Canada if such continuation is not opposed by the votes of more than one-third of the members of such House. "
  },
  {
    "paragraph": "1. The Constitution Act, 1871, 34-35 Vict., c. 28 (U.K.): "
  },
  {
    "paragraph": "2 The Parliament of Canada may from time to time establish new Provinces in any territories forming for the time being part of the Dominion of Canada, but not included in any Province thereof, and may, at the time of such establishment, make provision for the constitution and administration of any such Province, and for the passing of laws for the peace, order, and good government of such Province, and for its representation in the said Parliament. "
  },
  {
    "paragraph": "3 The Parliament of Canada may from time to time, with the consent of the Legislature of any province of the said Dominion, increase, diminish, or otherwise alter the limits of such Province, upon such terms and conditions as may be agreed to by the said Legislature, and may, with the like consent, make provision respecting the effect and operation of any such increase or diminution or alteration of territory in relation to any Province affected thereby. "
  },
  {
    "paragraph": "4 The Parliament of Canada may from time to time make provision for the administration, peace, order, and good government of any territory not for the time being included in any Province. "
  },
  {
    "paragraph": "5 The following Acts passed by the said Parliament of Canada, and intituled respectively, — “An Act for the temporary government of Rupert’s Land and the North Western Territory when united with Canada”; and “An Act to amend and continue the Act thirty-two and thirty-three Victoria, chapter three, and to establish and provide for the government of “the Province of Manitoba”, shall be and be deemed to have been valid and effectual for all purposes whatsoever from the date at which they respectively received the assent, in the Queen’s name, of the Governor General of the said Dominion of Canada. "
  },
  {
    "paragraph": "6 Except as provided by the third section of this Act, it shall not be competent for the Parliament of Canada to alter the provisions of the last-mentioned Act of the said Parliament in so far as it relates to the Province of Manitoba, or of any other Act hereafter establishing new Provinces in the said Dominion, subject always to the right of the Legislature of the Province of Manitoba to alter from time to time the provisions of any law respecting the qualification of electors and members of the Legislative Assembly, and to make laws respecting elections in the said Province. "
  },
  {
    "paragraph": "2. The Constitution Act, 1886, 49-50 Vict., c. 35 (U.K.): "
  },
  {
    "paragraph": "1 The Parliament of Canada may from time to time make provision for the representation in the Senate and House of Commons of Canada, or in either of them, of any territories which for the time being form part of the Dominion of Canada, but are not included in any province thereof. "
  },
  {
    "paragraph": "3. The Statute of Westminster, 1931, 22 Geo. V, c. 4 (U.K.): "
  },
  {
    "paragraph": "3 It is hereby declared and enacted that the Parliament of a Dominion has full power to make laws having extra-territorial operation. "
  },
  {
    "paragraph": "4. Under section 44 of the Constitution Act, 1982, Parliament has exclusive authority to amend the Constitution of Canada in relation to the executive government of Canada or the Senate and House of Commons. Sections 38, 41, 42 and 43 of that Act authorize the Senate and House of Commons to give their approval to certain other constitutional amendments by resolution. "
  },
  {
    "paragraph": "1. The Amendment from Time to Time, notwithstanding anything in this Act, of the Constitution of the Province, except as regards the Office of Lieutenant Governor. "
  },
  {
    "paragraph": "22 In and for the Province, the said Legislature may exclusively make Laws in relation to Education, subject and according to the following provisions: "
  },
  {
    "paragraph": "17 Section 93 of the Constitution Act, 1867, shall apply to the said province, with the substitution for paragraph (1) of the said section 93 of the following paragraph: "
  },
  {
    "paragraph": "17 Section 93 of the Constitution Act, 1867, shall apply to the said province, with the substitution for paragraph (1) of the said section 93, of the following paragraph: "
  },
  {
    "paragraph": "17 (1) In lieu of section ninety-three of the Constitution Act, 1867, this term shall apply in respect of the Province of Newfoundland and Labrador. "
  },
  {
    "paragraph": "17 In lieu of section ninety-three of the Constitution Act, 1867, the following shall apply in respect of the Province of Newfoundland: "
  },
  {
    "paragraph": "17 In lieu of section ninety-three of the Constitution Act, 1867, the following term shall apply in respect of the Province of Newfoundland: "
  },
  {
    "paragraph": "99 The Judges of the Superior Courts shall hold Office during good Behaviour, but shall be removable by the Governor General on Address of the Senate and House of Commons. "
  },
  {
    "paragraph": "118 The following Sums shall be paid yearly by Canada to the several Provinces for the Support of their Governments and Legislatures: "
  },
  {
    "paragraph": "1. (1) The following grants shall be made yearly by Canada to every province, which at the commencement of this Act is a province of the Dominion, for its local purposes and the support of its Government and Legislature: "
  },
  {
    "paragraph": "127 If any Person being at the passing of this Act a Member of the Legislative Council of Canada, Nova Scotia, or New Brunswick, to whom a Place in the Senate is offered, does not within Thirty Days thereafter, by Writing under his Hand addressed to the Governor General of the Province of Canada or to the Lieutenant Governor of Nova Scotia or New Brunswick (as the Case may be), accept the same, he shall be deemed to have declined the same; and any Person who, being at the passing of this Act a Member of the Legislative Council of Nova Scotia or New Brunswick, accepts a Place in the Senate shall thereby vacate his Seat in such Legislative Council. "
  },
  {
    "paragraph": "23 Either the English or the French language may be used by any person in the debates of the Houses of the Legislature, and both these languages shall be used in the respective Records and Journals of those Houses; and either of those languages may be used by any person, or in any Pleading or Process, in or issuing from any Court of Canada established under the British North America Act, 1867, or in or from all or any of the Courts of the Province. The Acts of the Legislature shall be printed and published in both those languages. "
  },
  {
    "paragraph": "145 Inasmuch as the Provinces of Canada, Nova Scotia, and New Brunswick have joined in a Declaration that the Construction of the Intercolonial Railway is essential to the Consolidation of the Union of British North America, and to the Assent thereto of Nova Scotia and New Brunswick, and have consequently agreed that Provision should be made for its immediate Construction by the Government of Canada; Therefore, in order to give effect to that Agreement, it shall be the Duty of the Government and Parliament of Canada to provide for the Commencement, within Six Months after the Union, of a Railway connecting the River St. Lawrence with the City of Halifax in Nova Scotia, and for the Construction thereof without Intermission, and the Completion thereof with all practicable Speed. "
  },
  {
    "paragraph": "37 (1) A constitutional conference composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada within one year after this Part comes into force. "
  },
  {
    "paragraph": "37.1 (1) In addition to the conference convened in March 1983, at least two constitutional conferences composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada, the first within three years after April 17, 1982 and the second within five years after that date. "
  },
  {
    "paragraph": "54.1 Part IV.1 and this section are repealed on April 18, 1987. "
  }
]